UserRoutes/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
        if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "'anka'"], ["email", " 'ankai@hot.com'"], ["updated_at", "2020-03-23 08:53:26.548716"], ["id", 14]]