music_app/app/views/albums/_form.html.erb

        <option disabled selected>-- select a Band --</option>
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"