music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 23]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 7]]
---

<% if @album.tracks.length > 0 %>
<ul class='main-list'>
    <% @album.tracks.each do |track| %>