music_app/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)

        if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdw"], ["year", 1999], ["band_id", 17], ["live", true], ["created_at", "2020-04-08 03:07:52.583707"], ["updated_at", "2020-04-08 03:07:52.583707"]]

    def update
      @album = Album.find(params[:id])
      if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "title" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["live", true], ["title", "New Gangstazzzz"], ["updated_at", "2020-04-07 22:56:56.823738"], ["id", 11]]