music_app/app/controllers/tracks_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "regular" = $1, "title" = $2, "lyrics" = $3, "updated_at" = $4 WHERE "tracks"."id" = $5  [["regular", false], ["title", "Still"], ["lyrics", "rails rails rrrrails adnadnandansldnkln"], ["updated_at", "2020-04-08 02:49:23.333250"], ["id", 2]]
---
    def update
      @track = Track.find(params[:id])
      if @track.update(track_params)