music_app/app/views/tracks/_form.html.erb

        <option disabled selected>-- select an Album --</option>
        <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"