music_app/app/views/tracks/show.html.erb


<% @track.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 19]]